#Service scanning

 The first thing we need to do is identify the operating system and any available services that might be running.

Nmap(Network Mapper) scan report:
    
securescripter@htb[/htb]$ nmap 10.129.42.253

Starting Nmap 7.80 ( https://nmap.org ) at 2021-02-25 16:07 EST
Nmap scan report for 10.129.42.253
Host is up (0.11s latency).
Not shown: 995 closed ports
PORT    STATE SERVICE
21/tcp  open  ftp
22/tcp  open  ssh
80/tcp  open  http
139/tcp open  netbios-ssn
445/tcp open  microsoft-ds

Nmap done: 1 IP address (1 host up) scanned in 2.19 seconds

By default, Nmap will conduct a TCP scan unless specifically requested to perform a UDP scan.

port 3389 is the default port for Remote Desktop Services.
   is an excellent indication that the target is a Windows machine.

 port 22 (SSH) being available indicates that the target is running Linux/Unix.
  this service can also be configured on Windows.

the -sC parameter to specify that Nmap scripts should be used to try and obtain more detailed information.
 The -sV parameter instructs Nmap to perform a version scan.
 -p- tells Nmap that we want to scan all 65,535 TCP ports.

#Nmap Scripts
Specifying -sC will run many useful default scripts against a target, but there are cases when running a specific script is required.

The syntax for running an Nmap script is nmap --script <script name> -p<port> <host>.

#Attacking Network Services
 ##Banner Grabbing
   banner grabbing is a useful technique to fingerprint a service quickly.
   Nmap will attempt to grab the banners if the syntax nmap -sV --script=banner <target> is specified.

   We can also attempt this manually using Netcat:nc -nv 10.129.42.253 21 targeting port 21

#FTP

 Nmap scan of the default port for FTP (21) reveals the vsftpd 3.0.3 installation that we identified previously. Further, it also reports that anonymous 
 authentication is enabled and that a pub directory is available.
   ftp -p 10.129.42.253

securescripter@htb[/htb]$ ftp -p 10.129.42.253

Connected to 10.129.42.253.
220 (vsFTPd 3.0.3)
Name (10.129.42.253:user): anonymous
230 Login successful.
Remote system type is UNIX.
Using binary mode to transfer files.

ftp> ls
227 Entering Passive Mode (10,129,42,253,158,60).
150 Here comes the directory listing.
drwxr-xr-x    2 ftp      ftp          4096 Feb 25 19:25 pub
226 Directory send OK.

ftp> cd pub
250 Directory successfully changed.

ftp> ls
227 Entering Passive Mode (10,129,42,253,182,129).
150 Here comes the directory listing.
-rw-r--r--    1 ftp      ftp            18 Feb 25 19:25 login.txt
226 Directory send OK.

ftp> get login.txt
local: login.txt remote: login.txt
227 Entering Passive Mode (10,129,42,253,181,53).
150 Opening BINARY mode data connection for login.txt (18 bytes).
226 Transfer complete.
18 bytes received in 0.00 secs (165.8314 kB/s)

ftp> exit
221 Goodbye.

 we see that FTP supports common commands such as cd and ls and allows us to download files using the get command. 
 Inspection of the downloaded login.txt reveals credentials that we could use to further our access to the system.
 
 

